* Barnes_B4_1974

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | Barnes_B4_1974
Place name                       | Barnes Ice Cap
Geographic location              | Canadian Arctic South
Ice type                         | Ice cap
Data Source                      | Graphic in science source
Data DOI                         | 
Science Source                   | Hooke, Roger LeB., Alexander, E. Calvin, Gustafson, Robert J.: Temperature profiles in the Barnes Ice Cap, Baffin Island, Canada, and heat flux from the subglacial terrane , Canadian Journal of Earth Sciences 17(9), Canadian Science Publishing, 1174–1188, sep 1980
Science DOI                      | 10.1139/e80-124
Date                             | 1975-07-08
Longitude [°E]                   | -72.0932
Latitude [°N]                    | 69.81379
Location Source                  | Location digitized by M. Jacquemart from Gilbert (2016)
Depth of top measurement [m]     | 0.0
Depth of bottom measurement [m]  | 110
Ice thickness [m]                | 110
Coverage [% of thickness]        | 100
Ice thickness source             | See science source
Note                             | "Date is ""Date completed"" from Hooke (1980) Table 1 Column 2 + Days to final measurement (Column 3); Temperature and location digitized by M. Jacquemart from Gilbert (2016)"
#+end_example


** Temperature

+ Any notes on source or data
+ Links to key papers

** Thickness

+ Notes on thickness
 
** Location

+ Notes on location

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
(head -n1 data.csv && tail -n +2 data.csv | sort -t, -n -k1)
#+END_SRC

#+RESULTS: ingest_data
|          d |          t |
|          0 | -10.067485 |
|  16.947474 |  -9.337423 |
|  35.976215 |  -8.521472 |
|  48.463825 |  -8.023313 |
|  63.032707 |  -7.422086 |
|   77.89891 |  -6.820859 |
| 109.712585 |  -5.635583 |


